[Weapon.WeaponTypes.WeaponType_FrontMachineGun WeaponTypeDefinition]
Typename=" Pirate vehicle with rocket launcher"
PickupMessage="You are rich %s"
UseFailureLevelMessage="Must be at least %d level to use this feature."
UseFailureConstraintsMessage="You can't use it.."
NoManufacturerName="common"

